tests/performance/ItemService/03-Resolve-Details.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3"><hashTree>
<TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="JMT-IS-03 - Concurrent Access-Control Protection" enabled="true"><stringProp name="TestPlan.comments">Stories 3, 5 and 7 security load. Twenty concurrent invalid-token requests attempt update, resolve, and delete operations. Every protected endpoint must return 401 and the target report must not be changed. Supply SECURITY_ITEM_ID; no valid credentials are stored here.</stringProp><elementProp name="TestPlan.user_defined_variables" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="HOST" elementType="Argument"><stringProp name="Argument.name">HOST</stringProp><stringProp name="Argument.value">${__P(HOST,localhost)}</stringProp></elementProp><elementProp name="PORT" elementType="Argument"><stringProp name="Argument.name">PORT</stringProp><stringProp name="Argument.value">${__P(PORT,5001)}</stringProp></elementProp><elementProp name="SECURITY_ITEM_ID" elementType="Argument"><stringProp name="Argument.name">SECURITY_ITEM_ID</stringProp><stringProp name="Argument.value">${__P(SECURITY_ITEM_ID,SET_ME)}</stringProp></elementProp><elementProp name="INVALID_TOKEN" elementType="Argument"><stringProp name="Argument.name">INVALID_TOKEN</stringProp><stringProp name="Argument.value">${__P(INVALID_TOKEN,not-a-valid-jwt)}</stringProp></elementProp><elementProp name="THREADS" elementType="Argument"><stringProp name="Argument.name">THREADS</stringProp><stringProp name="Argument.value">${__P(THREADS,20)}</stringProp></elementProp><elementProp name="RAMP_SECONDS" elementType="Argument"><stringProp name="Argument.name">RAMP_SECONDS</stringProp><stringProp name="Argument.value">${__P(RAMP_SECONDS,10)}</stringProp></elementProp></collectionProp></elementProp></TestPlan><hashTree>
<HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Invalid authentication" enabled="true"><collectionProp name="HeaderManager.headers"><elementProp name="invalid-auth-cookie" elementType="Header"><stringProp name="Header.name">Cookie</stringProp><stringProp name="Header.value">auth_token=${INVALID_TOKEN}</stringProp></elementProp></collectionProp></HeaderManager><hashTree/>
<ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="20 concurrent unauthenticated mutation attempts" enabled="true"><stringProp name="ThreadGroup.on_sample_error">STOPTHREAD</stringProp><elementProp name="ThreadGroup.main_controller" elementType="LoopController"><stringProp name="LoopController.loops">1</stringProp><boolProp name="LoopController.continue_forever">false</boolProp></elementProp><stringProp name="ThreadGroup.num_threads">${THREADS}</stringProp><stringProp name="ThreadGroup.ramp_time">${RAMP_SECONDS}</stringProp></ThreadGroup><hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Story 3 - Unauthorized update attempt" enabled="true"><stringProp name="HTTPSampler.domain">${HOST}</stringProp><stringProp name="HTTPSampler.port">${PORT}</stringProp><stringProp name="HTTPSampler.protocol">http</stringProp><stringProp name="HTTPSampler.path">/api/items/lost/${SECURITY_ITEM_ID}</stringProp><stringProp name="HTTPSampler.method">PUT</stringProp></HTTPSamplerProxy><hashTree><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Update returns 401" enabled="true"><collectionProp name="Asserion.test_strings"><stringProp name="1">401</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/></hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Story 5 - Unauthorized resolve attempt" enabled="true"><stringProp name="HTTPSampler.domain">${HOST}</stringProp><stringProp name="HTTPSampler.port">${PORT}</stringProp><stringProp name="HTTPSampler.protocol">http</stringProp><stringProp name="HTTPSampler.path">/api/items/lost/${SECURITY_ITEM_ID}/resolve</stringProp><stringProp name="HTTPSampler.method">POST</stringProp></HTTPSamplerProxy><hashTree><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Resolve returns 401" enabled="true"><collectionProp name="Asserion.test_strings"><stringProp name="1">401</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/></hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Story 7 - Unauthorized delete attempt" enabled="true"><stringProp name="HTTPSampler.domain">${HOST}</stringProp><stringProp name="HTTPSampler.port">${PORT}</stringProp><stringProp name="HTTPSampler.protocol">http</stringProp><stringProp name="HTTPSampler.path">/api/items/lost/${SECURITY_ITEM_ID}</stringProp><stringProp name="HTTPSampler.method">DELETE</stringProp></HTTPSamplerProxy><hashTree><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Delete returns 401" enabled="true"><collectionProp name="Asserion.test_strings"><stringProp name="1">401</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/></hashTree>
</hashTree></hashTree></hashTree></jmeterTestPlan>